In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
ser1 = Series([2, np.nan, 4, np.nan, 6, np.nan], index=['Q','R','S','T','U','V'])

ser1

Q    2.0
R    NaN
S    4.0
T    NaN
U    6.0
V    NaN
dtype: float64

In [3]:
ser2 = Series(np.arange(len(ser1)),dtype=np.float64, index=['Q','R','S','T','U','V'])

ser2

Q    0.0
R    1.0
S    2.0
T    3.0
U    4.0
V    5.0
dtype: float64

In [4]:
Series(np.where(pd.isnull(ser1),ser2,ser1), index=ser1.index)

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

In [5]:
ser1.combine_first(ser2) # This piece of code is the same as ---> Series(np.where(pd.isnull(ser1),ser2,ser1), index=ser1.index)

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

In [6]:
n = np.nan

df_odd = DataFrame({'X':[1., n, 3., n],
                   'Y':[n,5.,n,7.],
                   'Z':[n,9.,n,11]})

df_odd

     X    Y     Z
0  1.0  NaN   NaN
1  NaN  5.0   9.0
2  3.0  NaN   NaN
3  NaN  7.0  11.0

In [9]:
df_even = DataFrame({'X':[2.,4.,n,6.,8.],
                    'Y':[n,10.,12.,14.,16.]})

df_even

     X     Y
0  2.0   NaN
1  4.0  10.0
2  NaN  12.0
3  6.0  14.0
4  8.0  16.0

In [ ]:
df_odd.combine_first(df_even)